<template>
    <div class="main">
        <van-nav-bar fixed :title="title" left-arrow @click-left="onClickLeft" />
        <div class="list">
            <van-collapse v-model="activeName" accordion>
                <van-collapse-item title="1、无偿领养简介" name="1">
                    <h1>猫咪来源：</h1>
                    <p>无偿领养猫咪主要来源为：各类动物救助团体、猫咪救助志愿者、主人主动送养、猫舍退役种猫等等，每只猫咪的具体来源都会在详情页展示。</p>
                    <h1>信息平台：</h1>
                    <p>此网站提供猫咪领养信息平台，领养人可以通过城市距离来寻找猫咪，并可以在线查看猫咪的详细情况。</p>
                    <h1>送养保障：</h1>
                    <p>此网站提供三个保障机制来辅助筛选合格的领养人，分别是：押金反馈机制，黑名单自动检测机制，实名认证机制。</p>
                    <h1>领养人保障：</h1>
                    <p>此网站提供两个保障机制来帮助领养人解决猫咪健康及领养后的喂养问题，分别是：猫咪健康保障机制 和 领养后服务机制</p>
                </van-collapse-item>
                <van-collapse-item title="2、五大保障机制" name="2">
                    <h1>一、押金反馈机制</h1>
                    <p>领养人在领养猫咪的时候需要支付押金，领养后提交6次领养反馈后，押金返还，一般需要3个月；押金金额由送养人设置，若领养人没有反馈或者猫咪丢失死亡，押金转至送养人;</p>
                    <h1>二、黑名单自动检测机制</h1>
                    <p>领养人在支付领养押金的时候需要填写身份证号和姓名来进行黑名单检测，只有检测成功才可下单领养，也就是黑名单上的人无法下单领养；</p>
                    <h1>三、实名认证机制</h1>
                    <p>领养人在做黑名单检测时会同时进行实名认证，如果领养人出现违规情况，将直接进入黑名单;</p>
                    <h1>四、猫咪健康保障机制</h1>
                    <p>平台送养人处猫咪至少在送养人安置处观察5天以上，并在线通过领喵审核，尽最大可能保障送养猫咪健康;</p>
                    <h1>五、领养后服务机制</h1>
                    <p>此网站为每位领养人提供6个月的会员服务，包括平价养猫商品和在线宠物医生咨询诊疗，帮助领养人降低养猫成本解决养猫问题;</p>
                </van-collapse-item>
                <van-collapse-item title="3、领养条件" name="3">
                    <p>年满18周岁，已工作，有稳定的收入和可靠的经济来源；未成年人需监护人同意。</p>
                    <p>自有住房或整租楼房，群租、宿舍、店铺/公司均不可以，合租酌情考虑。</p>
                    <p>居住地阳台必须封窗，窗户有窗纱，不笼养，不散养，同住人员需同意领养猫咪（如家人恋人）。</p>
                    <p> 承诺按时驱虫免疫，幼猫到年龄绝育，有病及时就医。</p>
                    <p> 了解养猫知识，能接受猫咪掉毛，磨爪，顽皮，上床睡觉，抓家具等习性。</p>
                    <p> 承诺科学喂养，首选天然粮，不喂低端劣质猫粮（容易造成猫咪各种疾病，治疗费用远大于喂好猫粮的钱）。</p>
                </van-collapse-item>
                <van-collapse-item title="4、领养流程" name="4">
                    <p>第一步：在线选猫。</p>
                    <p>第二步：联系送养人，沟通并进行审核。</p>
                    <p>第三步：获得送养人授权后，在线完成黑名单自动检测和实名认证，最后下单。</p>
                    <p>第四步：携带身份证，与送养人约定时间地点交接猫咪。</p>
                    <p>第五步：领养反馈，按照要求添加领养反馈，完成后返回押金。</p>
                </van-collapse-item>
                <van-collapse-item title="5、无偿说明" name="5">
                    <p>无偿不是廉价，而是无价。</p>
                    <p>无偿代表责任，代表每一位送养人和救助人的信任。</p>
                    <p>实际上，在送养领养流程中，有一系列的成本支出，包括医疗救助、房租、健康检查、猫粮、日常清洁护理、疫苗驱虫、成猫绝育、各种交通费等等。这些成本目前由救助人、送养人、相关救助组织、合作医院以及领喵官方共同承担。</p>
                    <p>我们只希望猫咪能有一个负责任的主人，在以后的日子可以幸福的生活。</p>
                    <p>我们热情地欢迎每一位愿为猫咪负责的领养人，在这里遇见属于自己的猫咪。</p>
                </van-collapse-item>
            </van-collapse>

        </div>
    </div>
</template>

<script>
export default {
    data() {
        return {
            title: '',
            activeName: this.$route.query.name,
        }
    },
    mounted() {
        this.title = this.$route.query.title
    },
    methods:{
        onClickLeft() {
            this.$router.back()
        }
    }
}
</script>

<style scoped>
    .list{
        margin-top: 45px;
    }
</style>